<html>
<head><meta HTTP-EQUIV="Htm-Help" CONTENT="WiVSSSHelp_DEU.htm#Main_Contents">
<title>SIM Status Switcher Hilfe</title>
<keyword value="SIM Status Switcher;SIM;Radio;GSM;Phone;" title="SIM Status Switcher" href="WiVSSSHelp_DEU.htm#Main_Contents">
</head>
<body text="#000000" bgcolor="#ffffff">

<!-- PegHelp --><hr>
<a name="Main_Contents"></a>

<b>Inhalt SIM Status Switcher Hilfe</b><br>
<br>
<a href="WiVSSSHelp_DEU.htm#about_sss">&Uuml;ber den SIM Status Switcher</a><br>
<br>
<a href="WiVSSSHelp_DEU.htm#plugin_screen">Heute-Bildschirm Plug-in</a><br>
<br>
<a href="WiVSSSHelp_DEU.htm#plugin_options">Heute Plug-in Optionen Dialog</a><br>
<ul>
<li><a href="WiVSSSHelp_DEU.htm#display_settings">Einstellungen der Anzeige</a>
<li><a href="WiVSSSHelp_DEU.htm#appearance_settings">Einstellungen der Darstellung</a>
<li><a href="WiVSSSHelp_DEU.htm#actions_settings">Einstellungen der Aktionen</a>
<li><a href="WiVSSSHelp_DEU.htm#security_settings">Einstellungen der Sicherheit</a>
<li><a href="WiVSSSHelp_DEU.htm#language_settings">Einstellungen der Sprache</a>
<li><a href="WiVSSSHelp_DEU.htm#about_settings">Dialog &Uuml;ber</a>
</ul>
<a href="WiVSSSHelp_DEU.htm#information_dialog">Dialog Information</a>
<a href="WiVSSSHelp_DEU.htm#registration_dialog">Dialog Registrierung</a>

<!-- PegHelp --><hr>
<a name="about_sss"></a>

<b>Einf&uuml;hrung</b><br>
<br>
<b><i>&Uuml;ber dieses Produkt</i></b><br>
<br>
Der SIM Status Switcher erlaubt es Ihnen, den Status Ihrer SIM Karte leicht vom Heute-Bildschirm aus zu kontrollieren.<br>
<br>
Merkmale:
<ul>
<li>Wenn Sie einen Dual SIM Adapter verwenden, k&ouml;nnen Sie mit dem SIM Status Switcher ganz leicht vom Heute-Bildschirm aus zwischen den SIM Karten hin- und herschalten, ohne dass Sie das Telefon ein- und ausschalten oder den PIN Code eingeben m&uuml;ssen.
<li>Sie k&ouml;nnen nur die GSM Telefonfunktion ausschalten, ohne die Bluetooth- oder Wireless-Verbindung ausschalten zu m&uuml;ssen.
<li>Der Status und alle im Heute-Bildschirm gezeigten Informationen sind voll konfigurierbar.
<li>Die Unterst&uuml;tzung der Landessprache erfolgt durch besonders formatierte Textdateien, die der Anwender selbst erzeugen oder bearbeiten kann.
<li>Ben&ouml;tigt nur wenig Speicherplatz im Heute-Bildschirm.
<li>WM2003SE wird voll unterst&uuml;tzt (einschlie&szlig;lich Querformat-Anzeige, Navigation im Heute-Bildschirm ohne Verwendung des Stylus).
</ul>

Anforderungen:
<ul>
<li>Ger&auml;t mit Windows Mobile 2003 Phone Edition.
<li>Dual SIM Adapter (Plug-in kann aber auch ohne verwendet werden).
</ul>

<b><i>&Uuml;ber die Entwickler</i></b><br>
<br>
Unser Ziel bei WiViT ist es, die qualitativ und innovativ bestm&ouml;glichen mobilen Pocket PC Produkte anzubieten.<br>
<br>
Der SIM Status Switcher ist unser erstes Produkt und wir hoffen, dass noch viele weitere folgen werden!
<br>

<!-- PegHelp --><hr>
<a name="plugin_screen"></a>

<b>Heute Plug-in Bildschirm</b><br>
<br>
Wurde das Plug-in erst einmal aktiviert, werden folgende Informationen auf Ihrem Heute-Bildschirm angezeigt:<br>
<br>
<b>Bereit: [Telefonnummer]<br>
Netzbetreiber: [Service Provider] ([Home oder Roaming])</b><br>

<br>
Die Telefonnummer, die angezeigt wird, wird von der ersten Stelle des "Eigene Nummern" Bereichs der
SIM Karte &uuml;bernommen. Ist dort keine Nummer eingetragen, so wird "Nummer nicht verf&uuml;gbar" auf dem
Heute-Bildschirm des SIM Status Switcher statt der Telefonnummer angezeigt. Sie k&ouml;nnen Ihre Telefonnummer in dem
Bereich f&uuml;r eigene Nummern eingeben, indem Sie Start->Programme->SIM Manager->Werkzeuge->Liste der eigenen Nummern antippen.

<br>
Die unterschiedlichen Farben der Icons, die angezeigt werden, haben folgende Bedeutung:<br>

<ul>
<li>Wei&szlig; (Status ist aktuell verf&uuml;gbar)
<li>Rot (Telefonfunktion ist aus, SIM ist nicht bereit)
<li>Gelb (Telefonfunktion ist ein, SIM ist bereit aber Telefonbuch ist nicht bereit)
<li>Gr&uuml;n (Telefonfunktion ist ein und sowohl SIM als auch Telefonbuch sind bereit, genutzt zu werden)
</ul>

Die folgenden Antippen-und-Halten Aktionen sind nach der Installation aufrufbar, k&ouml;nnen jedoch &uuml;ber die Heute-Optionen ge&auml;ndert werden:<br>

<ul>
<li>Einmal antippen (das SIM Status Switcher Heute Plugin aktualisieren)
<li>Antippen und halten (das Popup Men&uuml; anzeigen)
<li>Heute Icon einmal antippen (Telefon ein- oder ausschalten)
<li>Heute Icon antippen und halten (die von Ihnen genutzte SIM Karte umschalten)
</ul>

<b><i>Popup Men&uuml;</i></b><br>
<br>
Die folgenden Men&uuml;-Punkte sind im Popup Men&uuml; aufrufbar:<br>

<ul>
<li>Optionen (Bringt Sie zu den Heute-Optionen des SIM Status Switcher)
<li>Aktualisieren (Dies aktualisiert die Daten im Heute Plug-in)
<li>SIM umschalten (Dies schaltet Ihre SIMs um)
<li>Telefon aus-/einschalten (Dies schaltet die Telefonfunktion aus oder ein. Nur die Telefonfunktion wird ausgeschaltet, Bluetooth oder Wifi sind nicht betroffen)
<li>Telefoneinstellungen (Bringt Sie zum Bildschirm mit Ihren Telefoneinstellungen)
</ul>

<!-- PegHelp --><hr>
<a name="plugin_options"></a>

<b>Heute Plug-in Optionen</b><br>
<br>
Der Heute-Optionen Dialog des SIM Status Switcher kann mit einer der folgenden Methoden aufgerufen werden:
<ul>
<li>Durch Ausf&uuml;hren der entsprechenden Antippen oder Antippen-und-Halten Aktion im Heute-Bildschirm.<br><br>
In der Voreinstellung erfolgt die Anzeige der Optionen im Popup Men&uuml;
durch Antippen und Halten auf der Heute-Bildschirm Information.<br>
Die Anzeige-Optionen k&ouml;nnen im Reiter "Anzeige" konfiguriert werden.<br><br>
<li>Durch Antippen des Optionen Knopfes f&uuml;r den SIM Status Switcher im Dialog Start->Einstellungen->Privat->Heute->Elemente.<br><br>
Beachten Sie, dass die Optionen nur angezeigt werden, wenn das Plug-in aktiviert ist.
</ul>

Im Heute-Optionen Dialog selbst sind die folgenden Reitersektionen verf&uuml;gbar:

<ul>
<li><a href="WiVSSSHelp_DEU.htm#display_settings">Anzeige</a>
<li><a href="WiVSSSHelp_DEU.htm#appearance_settings">Darstellung</a>
<li><a href="WiVSSSHelp_DEU.htm#actions_settings">Aktionen</a>
<li><a href="WiVSSSHelp_DEU.htm#security_settings">Sicherheit</a>
<li><a href="WiVSSSHelp_DEU.htm#language_settings">Sprache</a>
<li><a href="WiVSSSHelp_DEU.htm#about_settings">&Uuml;ber</a>
</ul>

Wenn Sie alle erforderlichen &Auml;nderungen in den Reitern vorgenommen haben, tippen Sie das OK Icon an, um die neuen Einstellungen zu speichern und den Optionen Dialog zu verlassen.
Die eingegebenen &Auml;nderungen sind sofort wirksam, wenn Sie zum Heute-Bildschirm zur&uuml;ckkehren.<br>
<br>
Wenn Sie irgendwelche eingegebenen &Auml;nderungen verwerfen m&ouml;chten, tippen Sie das X Icon an. Wenn &Auml;nderungen eingegeben worden sind, werden Sie in einer Meldung
darauf hingewiesen, um sicher zu sein, ob Sie die &Auml;nderungen zur&uuml;cknehmen wollen. Tippen Sie den Ja Knopf an, ohne irgendwelche &Auml;nderungen zu speichern.
Wenn Sie Ihre &Auml;nderungen nicht zur&uuml;cknehmen wollen, tippen Sie den Nein Knopf an.<br>
<br>
Bei allen Reitern der Heute Plug-in Optionen ist jeweils ein Link am Fu&szlig; des Bildschirms aufrufbar, &uuml;ber den
Sie den Bildschirm mit Ihren Telefoneinstellungen erreichen k&ouml;nnen.<br>
<br>

<!-- PegHelp --><hr>
<a name="display_settings"></a>

<b>Einstellungen der Anzeige</b><br>
<br>
Im Reiter "Anzeige" haben Sie die M&ouml;glichkeit zu &auml;ndern, was im Heute-Bildschirm durch das Plug-in angezeigt wird. Durch Auswahl der Ankreuzfelder
sind die folgenden Kombinationen verf&uuml;gbar:

<ul>
<li>Telefonnummer und Netzbetreiber in einer oder zwei Zeilen anzeigen.
<li>Nur Telefonnummer anzeigen, wird nur in einer Zeile angezeigt.
<li>Nur Netzbetreiber in einer oder zwei Zeilen anzeigen.
</ul>

Der Status der SIM (Ein/Aus) wird in allen Kombinationen angezeigt.<br>
<br>

<!-- PegHelp --><hr>
<a name="appearance_settings"></a>

<b>Einstellungen der Darstellung</b><br>
<br>
Im Reiter "Darstellung" k&ouml;nnen Sie die Darstellung der im Heute Plug-in gezeigten Informationen &auml;ndern.
Folgendes kann ge&auml;ndert werden:

<ul>
<li>&Auml;ndern der ersten und/oder zweiten Zeile der Informationen auf Fettschrift oder nicht.
<li>&Auml;ndern des Icon Sets, welches im Heute Plug-in Bildschirm verwendet wird.<br>
Die folgenden eingebetteten Icon Sets sind verf&uuml;gbar:
<ul>
<li>Standard Telefon
<li>Telefon Knopf
<li>Mobiltelefon
<li>PDA
<li>Verkehrsampel
<li>Radiofunkr&ouml;hre
</ul>
</ul>
<br>

<!-- PegHelp --><hr>
<a name="actions_settings"></a>

<b>Einstellungen der Aktionen</b><br>
<br>
Der Reiter "Aktionen" erm&ouml;glicht Ihnen zu &auml;ndern, was bei jeder Antippen oder Antippen-und-Halten Aktion ausgef&uuml;hrt wird. Folgendes kann ge&auml;ndert werden:

<ul>
<li>Einmal antippen
<li>Antippen und halten
<li>Heute Icon einmal antippen
<li>Heute Icon antippen und halten
</ul>

Jedes Antippen oder Antippen-und-Halten kann mit einer der folgenden Aktionen belegt werden:

<ul>
<li>Aktualisieren (dies aktualisiert das Heute Plug-in)
<li>Popup Men&uuml; anzeigen (dies zeigt die Popup Men&uuml; Optionen)
<li>Optionen (bringt Sie zu den Heute-Optionen des SIM Status Switcher)
<li>SIM umschalten (dies schaltet Ihre SIMs um)
<li>Telefon Aus/Ein (dies schaltet Ihre Telefonfunktion aus oder ein)
<li>Telefoneinstellungen (bringt Sie zum Bildschirm mit Ihren Telefoneinstellungen)
</ul>

Die nach der Installation aufrufbaren voreingestellten Aktionen sind:<br>

<ul>
<li>Einmal antippen: <i>Aktualisieren</i>
<li>Antippen und halten: <i>Popup Men&uuml; anzeigen</i>
<li>Heute Icon einmal antippen: <i>Telefon Aus/Ein</i>
<li>Heute Icon antippen und halten: <i>SIM umschalten</i>
</ul>
<br>

<!-- PegHelp --><hr>
<a name="security_settings"></a>

<b>Einstellungen der Sicherheit</b><br>
<br>
Der Reiter "Sicherheit" erlaubt Ihnen die automatische Eingabe des Pin Codes f&uuml;r die SIM Karte einzustellen, die Sie gerade nutzen. Zwei Stufen der Pin Code Eingabe sind verf&uuml;gbar:

<ul>
<li>Nach Soft-Reset oder Plugin-Aktivierung
<li>Wenn Telefon eingeschaltet wird
</ul>

Sie k&ouml;nnen ein oder beide Ankreuzfelder ausw&auml;hlen. Nach der Auswahl, tippen Sie den "PIN eingeben" Knopf an, geben Ihren Pin Code ein und tippen OK an.
Sie m&uuml;ssen sie nun erneut eingeben, um zu best&auml;tigen, dass Sie die PIN korrekt eingegeben haben. Tippen Sie auf OK, um den Vorgang abzuschlie&szlig;en. Das Antippen von Abbruch zu irgendeinem
Zeitpunkt unterbricht den aktuellen Vorgang.<br>
<br>
Wenn Sie Ihre PIN &auml;ndern m&ouml;chten, k&ouml;nnen Sie dies tun, indem Sie den "PIN &auml;ndern" Knopf antippen. Wenn Sie dies tun, werden Sie aufgefordert,
Ihre aktuelle PIN einzugeben, im Anschluss dessen nach Ihrer neuen PIN gefragt. Tippen Sie zum Akzeptieren OK an und geben Sie anschlie&szlig;end Ihre PIN noch einmal
zur Best&auml;tigung ein. Tippen Sie auf OK, um den Vorgang abzuschlie&szlig;en. Das Antippen von Abbruch zu irgendeinem Zeitpunkt unterbricht den aktuellen Vorgang.<br>
<br>
Um die automatische PIN Eingabe f&uuml;r die zweite SIM Karte einzustellen, schalten Sie auf Ihre zweite SIM um und wiederholen Sie den Vorgang von oben.<br>
<br>
Die PIN Nummern k&ouml;nnen f&uuml;r jede SIM unterschiedlich sein.
<br>
Die PIN Eingabe f&uuml;r eine SIM ist nur erforderlich, wenn in den Telefoneinstellungen konfiguriert ist, dass eine PIN ben&ouml;tigt wird und die SIM
es anfordert - was zutrifft, wenn die Telefonfunktion eingeschaltet ist. Diese Einstellungen im SIM Status Switcher sind vorgesehen, um die PIN
bei Bedarf zu liefern, wenn die Telefonfunktion startet, gleich ob auf Grund eines Soft-Resets oder weil die Telefonfunktion ausgeschaltet war
und anschlie&szlig;end wieder ein - zum Beispiel, wenn die "SIM umschalten" Option genutzt wird. "Nach Plugin-Aktivierung" bedeutet, dass wenn Ihr Telefon auf die
PIN wartet und Sie dann das SIM Status Switcher Plug-in aktivieren, es die PIN eingeben wird,
wenn Sie es spezifiziert haben dies so zu tun.
<br>

<!-- PegHelp --><hr>
<a name="language_settings"></a>

<b>Einstellungen der Sprache</b><br>
<br>
Im Reiter "Sprache" haben Sie die M&ouml;glichkeit die Sprache zu &auml;ndern, die bei den angezeigten Informationen verwendet wird.
<br>
Es wird die aktuell voreingestellte Sprache angezeigt und eine Liste der zur Auswahl stehenden verf&uuml;gbaren Sprachen.
<br>
<br>

<!-- PegHelp --><hr>
<a name="about_settings"></a>

<b>&Uuml;ber Dialog</b><br>
<br>
Der Reiter "&Uuml;ber" zeigt die Version und die Copyright Informationen des Produktes.
Er gibt au&szlig;erdem an, ob die Produktlizenz eine Trialversion ist oder gekauft und registriert wurde.<br>
<br>
&Uuml;ber diesen Bildschirm k&ouml;nnen Sie auch die folgenden Dialoge erreichen:

<ul>
<li><a href="WiVSSSHelp_DEU.htm#registration_dialog">Registrierung</a>
<li><a href="WiVSSSHelp_DEU.htm#information_dialog">Information</a>
</ul>

<!-- PegHelp --><hr>
<a name="information_dialog"></a>

<b>Dialog Information</b><br>
<br>

Im Dialog Information werden folgende Informationen angezeigt:

<ul>
<li>Ger&auml;te-Informationen (Hersteller, Modell, Revision, Seriennummer)
<li>SIM-Informationen (Telefonnummer, Kunden ID, Seriennummer)
<li>Telefonbuchspeicher (Speicherort, Eintr&auml;ge gesamt, gespeicherte Eintr&auml;ge)
</ul>

<!-- PegHelp --><hr>
<a name="registration_dialog"></a>

<b>Dialog Registrierung</b><br>
<br>
Geben Sie den 20 Zeichen Lizenzcode, den Sie von WiViT erhalten haben, in die angezeigten 5 Eingabefelder ein.<br>
<br>
Nachdem Sie den Lizenzcode eingegeben haben, tippen Sie zum Speichern auf OK und kehren Sie zum &Uuml;ber-Bildschirm zur&uuml;ck.<br>
Damit die neue Lizenz wirksam wird, m&uuml;ssen Sie entweder einen Soft-Reset durchf&uuml;hren, oder in den Einstellungen in Heute->Elemente
das SIM Status Switcher Heute Plug-in deaktivieren und wieder aktivieren.<br>
<br>
Nachdem Sie wie oben beschrieben vorgegangen sind, zeigt der &Uuml;ber-Bildschirm den Status der eingegebenen Lizenz.<br>
<br>

<!-- PegHelp --><hr>

</body>
</html>
